[
  {
    "id": "1lbnxm2",
    "subreddit": "AmItheAsshole",
    "title": "AITA for being my dad’s favorite child?",
    "text": "I (32F) have a younger sister (31F) who is neurodivergent and an older brother (37M), a rainbow baby. Growing up, I often felt unwanted. My accomplishments were always overshadowed by my siblings. I was expected to cook, clean, get straight A’s, especially since my brother dropped out of high school. My mom was always afraid I’d “end up like him,” yet still clearly loved them more.\n\nAt 12-13, I really started noticing the favoritism. My brother could stay out until 2 a.m. with his stoner friends. My sister got shopping sprees with my mom’s credit card. I couldn’t even go to the library. My dad noticed this too, and we became close. He never said it, but it was obvious I was his favorite. I got a lot of crap for it like my siblings would make me clean their rooms or yell at me when he wasn’t around.\n\nMy sister tried so hard to earn my dad’s love and attention. I understood why, I just finally had one parent who asked about my day instead of just my grades and chores.\n\nNow, fast-forward ",
    "score": 2047,
    "comments": 82,
    "timestamp": "2025-06-15T00:58:34"
  },
  {
    "id": "1lb98nx",
    "subreddit": "relationship_advice",
    "title": "My (29f) husband (31m) wants kids but I think I want a divorce…",
    "text": "My husband I have been together for 8 years, the last 3 we’ve been married. Little things keep adding up and I don’t even know how to approach these issues. He wants kids soon but I can’t trust that he’d support me. I’m trying to figure out if I try to work on us or just leave. \n\nRecently as in the last 4 years, I have been dealing with chronic health issues but just this year alone I’ve had 3 surgeries to fix various things for my health. Our sex life hasn’t been good in a few years since I got ill. Maybe once or twice a month, he has told me that it’s not enough and he’s feeling rejected and is making his mental health worse but if we have kids we won’t be able to have sex while I’m recovering?\n\nI work 5-6 days a week 12 hour night shifts in healthcare. I am the primary breadwinner in our relationship, he bounces from job to job and recently was unemployed for over a year while he was claiming to be applying to jobs. I know the job market is horrible right now so I wasn’t pushing. I ",
    "score": 952,
    "comments": 279,
    "timestamp": "2025-06-14T13:53:44"
  },
  {
    "id": "1lc1sr6",
    "subreddit": "relationship_advice",
    "title": "UPDATE: How can I (F24) deal with the fact my boyfriend (M26) dreads getting married to me?",
    "text": "Hey, I made a post about a week or so ago explaining that my boyfriend was suddenly acting really weird and angry about the idea of a wedding. It took a bit of time for him to think about it but he sat me down the same night that I made the initial post and read me a letter he had been working on for about a week. He explained it was the second draft and not super polished but when he started reading it, I felt the blood drain from my face. It was over 2,000 words about how I’m depressed and here’s all of the ways it affected him. \n\nHe acknowledged it was the worst depressive episode he’s ever seen me in and instead of trying to get me help, he compared my negativity to his ex girlfriend. He said so many hurtful things and later admitted that he never considered how the letter would affect me. \n\nI asked for a copy of the letter to go over in my own time and as I read it on my own I realized that there was no saving the relationship. I will never stay with someone that would spend a sig",
    "score": 1339,
    "comments": 32,
    "timestamp": "2025-06-15T14:35:53"
  },
  {
    "id": "1lamn5q",
    "subreddit": "tifu",
    "title": "TIFU by complaining about men who dye their hair in front of my friend… whose husband dyes his hair",
    "text": "\nUPDATE showed my friend this post and she was dying with laughter !!! She told me she can’t stand asymmetric bobs and I said that was a good payback ( I have one ) we said we will be laughing about this for years to come !!\n\nThis happened yesterday and I’m still cringing.\n\nWe were all hanging out, me, my husband, and one of my close friends and her husband. Casual evening, wine flowing, conversation meandering from work drama to random pet peeves.\n\nAt some point, I started venting (okay, maybe passionately ranting) about how I cannot stand when men dye their hair. I don’t even know what set me off, maybe it was something we saw on TV, but I just went off about how it always looks weird or artificial and how I wish men would just embrace the gray and age gracefully.\n\nMid-rant, I notice my friend has gone really quiet. I stop and look at her, and she gives me this deadpan expression before saying, “I make my husband dye his hair.”\n\nCue the longest silence ever.\n\nApparently, she prefers ",
    "score": 971,
    "comments": 185,
    "timestamp": "2025-06-13T18:00:23"
  },
  {
    "id": "1lcbfbh",
    "subreddit": "relationship_advice",
    "title": "I (32 F) caught my husband (36 M) cheating last night. He was texting his lover. We’ve been married for over 11 years, we have a 5yo together.",
    "text": "I’m an absolute wreck. I’m a stay at home mom, I take care of everything and he goes to work. His job pays well so he can provide us with a good life, but he said he has feelings for this woman and he’s not ready to let everything go. He wants us to stay married and live the nice life we always had, he doesn’t like the idea of a divorce for lots of reasons, first of all our son. I LITERALLY HAD NO IDEA. It was fate that I caught him. He’s probably been extremely cautious about it with his dating, we had a good life together, some arguments here and there but still having sex regularly and acting like a family. I asked him to cut ties with his person but he says he can’t because he doesn’t want to hurt her. This pisses me off so much. I even talked about couple counseling which he agreed to. Still he can’t let her go and he wants her as a friend. I’m still shocked. I don’t know what to do, what to think, what to say. We discussed about divorce which it wouldn’t be imminent since I’d hav",
    "score": 651,
    "comments": 272,
    "timestamp": "2025-06-15T21:22:11"
  },
  {
    "id": "1lby7vp",
    "subreddit": "relationship_advice",
    "title": "My fiance (46M) asked me (39F) to use my name to buy a Range Rover while he makes monthly payments?",
    "text": "So I met this guy (46) in October via online dating and he seemed nice we started dating. He told me he never wanted to get married again. We are in the uk btw. \n\nSuddenly in April he told me he wanted to marry me. He proposed and then a few weeks later told me he wanted me to use my company name to buy a new car for him since his old Range Rover had developed a fault that would cos 5k to repair. \n\nHe said his credit was bad due to the divorce etc. he said couples should help each other and if I can't do this for him what exactly am I bringing to the table. \n\nHe has a good job btw and said this is his 3rd Range Rover. \n",
    "score": 359,
    "comments": 382,
    "timestamp": "2025-06-15T11:33:59"
  },
  {
    "id": "1lblt1p",
    "subreddit": "AmItheAsshole",
    "title": "AITA for not allowing my father to control my future education?",
    "text": "I 17 (f) got accepted into my dream university something I’ve been working hard for since freshman year. Now since I’m graduated and began working two jobs to pay for college. \n\nMy father 56 (m) recently sat me down and told me I wasn’t allowed to go because he don’t trust me to go 2hrs away and believe it’s best I should go to a community college close to house house. (little background my parents are divorced and I with my mother.) When I told my father how I didn’t want that and want to go to my dream college he told me he didn’t care and began telling me how he’s going to sign me up for classes and didn’t care if I cried because it’s only “two years and it’s goes by fast.” and that “He’s helping me not be in college debt.”  \n\nRather my mom having my back she agreed because the community college near me is free and very closed to the house so I cannot  spend money and just stay here. \n\nEvery time I tried to express myself and say I’ll take my debt and pay it myself my parents hair i",
    "score": 472,
    "comments": 146,
    "timestamp": "2025-06-14T23:11:27"
  },
  {
    "id": "1lc4ptm",
    "subreddit": "AmItheAsshole",
    "title": "AITA for not including my step mom in purchasing my dad’s Father’s Day gifts?",
    "text": "For context, she’s not officially my step mom yet as her and my dad are set to get married in August. She has been living with us for a while, and we haven’t always gotten a long but have been civil and respectful towards each other, I guess up until now.\n\nMy brother [18 M] and I [24 F] bought my dad his father’s day gifts a couple weeks ago, just so we wouldn’t have to worry about it last minute. The gifts weren’t anything huge, just two small gifts, we never go all out for father’s day like that. I didn’t tell my dad’s fiancé or anything because I really didn’t see a reason too, plus she never asked. \n\nMy dad didn’t get her a gift on Mother’s day, and her and my dad left on Mother’s day to go have lunch with her kids who don’t live with us. She also never communicated with me about getting him gifts, any plans on what to do, etc. So I didn’t think it was even that big of a deal.\n\nToday, I woke up early, had breakfast and then woke my brother up so we could give my dad his gifts, my d",
    "score": 638,
    "comments": 38,
    "timestamp": "2025-06-15T16:40:27"
  },
  {
    "id": "1lc8q79",
    "subreddit": "AmItheAsshole",
    "title": "AITAH for yelling at my parents?",
    "text": "I (16M) live with my parents and my 8-year-old sister. For the past few months, my parents have been arguing constantly. Like, yelling almost every night, slamming doors, cussing each other out over everything money, us, their parents.\n\nMost of the time I just try to tune it out, but my little sister can’t. She gets scared and runs into my room crying, asking me if they’re getting divorced or if she did something wrong. I do my best to calm her down, but it’s hard. She’s a kid.\n\nLast night it got really bad again and I just snapped. I came out of my room and yelled at both of them to shut up. I told them they’re scaring her and making everything worse, and that I’m tired of pretendin everything’s normal when it’s not. I might’ve said something like “You’re both acting like fucking children,” which, yeah, not my proudest line.\n\nThey both got quiet but later my mom told me I was out of line and that I “don’t understand how hard it is being an adult.” My dad didn’t say much, just gave me ",
    "score": 412,
    "comments": 101,
    "timestamp": "2025-06-15T19:26:40"
  },
  {
    "id": "1lc1lbn",
    "subreddit": "relationship_advice",
    "title": "My SIL [40F] is trying to set my husband [44M] up with her friend. How do I [34F] handle this?",
    "text": "I [34] have felt for a long time that my SIL [40] doesn’t like me very much. I’ve been married for 8 years and in this relationship for 13 years. For the last few years I’ve noticed her making backhanded comments to me and doing petty things. One example is that this past Christmas, she “gifted” my husband and I an ornament which was a picture of the whole family - everyone except me. She made a point of making it known I wasn’t in it and how it was “Too bad, since it’s such a great photo!” More recently, she called me a bitch because I offered her some dessert at a family gathering.\n\nFor context, my father [63] died of ALS last May after a year long, horrific battle. I won’t go into great detail, but my husband and I spent that year in and out of hospitals and nursing homes until ultimately I had to make the choice to take him off oxygen. My husband was the only one supporting me during this time, as my brother lives across the country and my mom died of cancer in 2011. \n\nMy MIL [73] ",
    "score": 524,
    "comments": 38,
    "timestamp": "2025-06-15T14:26:33"
  }
]